artillery/load-data.yml
config:
  target: 'https://scc24appwesteurope68881.azurewebsites.net/rest'
  plugins:
    metrics-by-endpoint:
      useOnlyRequestNames: true
  processor: "./test-utils.js"
  variables:
     metricsProcessEndpoint : "myProcessEndpoint"  # function used to aggregate endpoints for statistics
  phases:
  - name: "Create users"    # Create users
    duration: 1
    arrivalCount: 1

scenarios:
  - name: 'Create users'
    weight: 1
    flow:
      - loop:                            # let's create 950 users - loop ... count
        - function: "genNewUser"         # Generate the needed information for the user
        - post:
            beforeRequest: "uploadImageBody"
            url: "/user"
            headers:
              Content-Type: multipart/form-data
              Accept: application/json
            formData:
              user: '{"id":"{{ userid }}","name":"{{ name }}","pwd":"{{ pwd }}"}'
              image: "{{ image }}"
            afterResponse: "genNewUserReply"    # capture result and store in file
        count: 250
      - loop:                            # let's create 50 users - loop ... count
        - function: "genNewUser"         # Generate the needed information for the user
        - post:
            beforeRequest: "uploadImageBody"
            url: "/user"
            headers:
              Content-Type: multipart/form-data
              Accept: application/json
            formData:
              user: '{"id":"{{ userid }}","name":"{{ name }}","pwd":"{{ pwd }}"}'
              image: "{{ image }}"
            afterResponse: "genNewUserReply"    # capture result and store in file
        - post:
            url: "/user/auth"
            headers:
              Content-Type: application/json
            json:
              user: "{{ userid }}"
              pwd: "{{ pwd }}"
        - loop:                            # let's create 50 users - loop ... count
          - function: "genNewHouse"         # Generate the needed information for the house
          - post:
              beforeRequest: "uploadImageBody"
              url: "/house"
              headers:
                Content-Type: multipart/form-data
                Accept: application/json
              formData:
                house: '{"name":"{{ name }}","location":"{{ location }}", "description":"{{ description }}"}'
                image: "{{ image }}"
              capture:
                json: "$.id"
                as: "houseid"              # capture the house id to be used in house creation
          - post:                          # make this house available
              url: "/house/{{ houseid }}/available"
              headers:
                Content-Type: application/json
                Accept: application/json
              json:
                fromDate: "12-2023"
                toDate: "12-2024"
                cost: "{{ cost }}"
                discount: "{{ discount }}"
          whileTrue: "random90"
        count: 250